validacao/results/xvwa/coraza/06_wrk.log
=== wrk | xvwa/coraza | https://172.18.0.9:443/xvwa/ | 17/07/2026 20:58:13,78 ===
REPETICOES: 1
CMD: wrk -t12 -c400 -d30s --timeout 5s --latency -H "User-Agent: DoBotShield-TCC-Validation/1.0" https://172.18.0.9:443/xvwa/
----------------------------------------------------------------

=== EXECUCAO UNICA ===
Running 30s test @ https://172.18.0.9:443/xvwa/
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.19s     1.26s    4.99s    63.54%
    Req/Sec    15.27     11.92    89.00     74.06%
  Latency Distribution
     50%    2.38s 
     75%    3.07s 
     90%    3.75s 
     99%    4.77s 
  3970 requests in 30.09s, 41.37MB read
  Socket errors: connect 0, read 0, write 0, timeout 465
Requests/sec:    131.94
Transfer/sec:      1.37MB
RUN_RC=0

TOOL_RC=0