validacao/results/xvwa/coraza/06_wrk.log
=== wrk | xvwa/coraza | https://172.18.0.9:443/xvwa/ | 17/07/2026 20:58:13,78 ===
REPETICOES: 3
CMD: wrk -t12 -c400 -d30s --timeout 5s --latency -H "User-Agent: DoBotShield-TCC-Validation/1.0" https://172.18.0.9:443/xvwa/
----------------------------------------------------------------

=== REPETICAO 1/3 ===
Running 30s test @ https://172.18.0.9:443/xvwa/
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.19s     1.26s    4.99s    63.54%
    Req/Sec    15.27     11.92    89.00     74.06%
  Latency Distribution
     50%    2.38s 
     75%    3.07s 
     90%    3.75s 
     99%    4.77s 
  3970 requests in 30.09s, 41.37MB read
  Socket errors: connect 0, read 0, write 0, timeout 465
Requests/sec:    131.94
Transfer/sec:      1.37MB
RUN_RC_1=0

=== REPETICAO 2/3 ===
Running 30s test @ https://172.18.0.9:443/xvwa/
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.62s     1.07s    5.00s    65.35%
    Req/Sec    14.24     10.61    80.00     76.28%
  Latency Distribution
     50%    2.58s 
     75%    3.29s 
     90%    4.16s 
     99%    4.88s 
  3862 requests in 30.10s, 40.25MB read
  Socket errors: connect 0, read 0, write 0, timeout 188
Requests/sec:    128.31
Transfer/sec:      1.34MB
RUN_RC_2=0

=== REPETICAO 3/3 ===
Running 30s test @ https://172.18.0.9:443/xvwa/
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.65s     1.02s    4.99s    64.66%
    Req/Sec    15.28     12.20    80.00     72.13%
  Latency Distribution
     50%    2.64s 
     75%    3.38s 
     90%    4.05s 
     99%    4.80s 
  3961 requests in 30.10s, 41.27MB read
  Socket errors: connect 0, read 0, write 0, timeout 155
Requests/sec:    131.59
Transfer/sec:      1.37MB
RUN_RC_3=0

TOOL_RC=0